### Завдання 1 — Зарплати
###Знайдіть суму зарплат, що перевищують 35000 грн, після підвищення на 10%.
from functools import reduce

# Є список зарплат: 
salaries = [30000, 45000, 28000, 60000, 52000, 33000]

# 1. Підвищення на 10%
raised = list(map(lambda s:round( s * 1.1, 2), salaries))

# 2. Тільки більше 35000
high = list(filter(lambda s: s > 35000, raised))

# 3. Сума
total = reduce(lambda acc, s: acc + s, high, 0) # поступово об’єднуємо всі елементи в одне значення.

print(f"Підвищені зарплати: {raised}")
print(f"Зарплати понад 35000 грн: {high}")
print(f"Сума: {total:.2f} грн")

### Завдання 2 — Слова
###   Є текст. Знайдіть усі унікальні слова, довші за 4 символи, 
###  та виведіть їх в алфавітному порядку (нижній регістр).

text = "Python це потужна мова програмування яка підходить для різних задач"

# Розбити на слова, розділяємо текст на окремі слова та зберігаємо їх у списку words
words = text.split()

# Тільки довші за 4 символи, в нижньому регістрі, без дублів
# переводимо слова в нижній регістр;залишаємо слова довші за 4 символи;видаляємо дублікати;сортуємо слова за алфавітом;
long_unique = sorted(set(filter(lambda w: len(w) > 4, map(str.lower, words))))

print(long_unique)